app/Models/DataAccess.php

UPDATE `fichefrais` SET `idEtat` = 'RF', `dateModif` = '2025-05-07 09:48:27', `commentaire` = ';tgt;'
WHERE `idVisiteur` = 'a131'
AND `mois` = '202501'
---
	public function updateEtatFiche($idVisiteur, $mois, $etat, $motif = null)
{
    $builder = $this->db->table('fichefrais');
    $data = [
        'idEtat' => $etat,
        'dateModif' => date('Y-m-d H:i:s'),
        'commentaire' => $motif
    ];
    $builder->where('idVisiteur', $idVisiteur);
    $builder->where('mois', $mois);
    $builder->update($data);